{"spider": "nvidia", "url": "https://nvidianews.nvidia.com/news/nvidia-and-storage-industry-leaders-unveil-new-class-of-enterprise-infrastructure-for-the-age-of-ai", "title": "NVIDIA and Storage Industry Leaders Unveil New Class of Enterprise Infrastructure for the Age of AI", "date": "2025-03-18 00:00:00", "content": "GTC—\nNVIDIA today announced the\nNVIDIA AI Data Platform\n, a customizable reference design that leading providers are using to build a new class of AI infrastructure for demanding AI inference workloads: enterprise storage platforms with AI query agents fueled by NVIDIA accelerated computing, networking and software.\nUsing the NVIDIA AI Data Platform,\nNVIDIA-Certified Storage\nproviders can build infrastructure to speed AI reasoning workloads with specialized AI query agents. These agents help businesses generate insights from data in near real time, using\nNVIDIA AI Enterprise\nsoftware — including\nNVIDIA NIM\n™ microservices for the new\nNVIDIA Llama Nemotron models\nwith reasoning capabilities — as well as the new\nNVIDIA AI-Q Blueprint\n.\nStorage providers can optimize their infrastructure to power these agents with\nNVIDIA Blackwell GPUs\n,\nNVIDIA BlueField\n®\nDPUs\n,\nNVIDIA Spectrum-X\n™\nnetworking\nand the\nNVIDIA Dynamo\nopen-source inference library.\nLeading data platform and storage providers — including\nDDN\n,\nDell Technologies\n,\nHewlett Packard Enterprise\n,\nHitachi Vantara\n,\nIBM\n,\nNetApp\n,\nNutanix\n,\nPure Storage\n,\nVAST Data\nand\nWEKA\n— are collaborating with NVIDIA to create customized AI data platforms that can harness enterprise data to reason and respond to complex queries.\n“Data is the raw material powering industries in the age of AI,” said Jensen Huang, founder and CEO of NVIDIA. “With the world’s storage leaders, we’re building a new class of enterprise infrastructure that companies need to deploy and scale agentic AI across hybrid data centers.”\nNVIDIA AI Data Platform Adds Accelerated Computing and AI to Storage\nThe NVIDIA AI Data Platform brings accelerated computing and AI to the millions of businesses using enterprise storage for the data that drives their company.\nNVIDIA Blackwell GPUs, BlueField DPUs and Spectrum-X networking provide an accelerated engine to speed AI query agent access to data stored on enterprise systems. BlueField DPUs deliver up to 1.6x higher performance than CPU-based storage while reducing power consumption by up to 50%, providing more than 3x higher performance per watt. Spectrum-X accelerates AI storage traffic up to 48% compared with traditional Ethernet by applying adaptive routing and congestion control.\nAI Data Platform storage infrastructure uses the\nNVIDIA AI-Q Blueprint\nfor developing agentic systems that can reason and connect to enterprise data. AI-Q taps into\nNVIDIA NeMo Retriever™ microservices\nto accelerate data extraction and retrieval by up to 15x on NVIDIA GPUs.\nAI query agents built with the\nAI-Q Blueprint\nconnect to data during inference to provide more accurate, context-aware responses. They can access large-scale data quickly and process various data types, including structured, semi-structured and unstructured data from multiple sources, including text, PDF, images and video.\nStorage Industry Leaders Building AI Data Platforms With NVIDIA\nNVIDIA-Certified Storage partners are collaborating with NVIDIA to build custom AI data platforms.\nDDN\nis architecting AI Data Platform capabilities into its DDN Infinia AI platform.\nDell\nis creating AI data platforms for its family of Dell PowerScale and Project Lightning solutions.\nHewlett Packard Enterprise\nis infusing AI Data Platform capabilities into HPE Private Cloud for AI, HPE Data Fabric, HPE Alletra Storage MP and HPE GreenLake for File Storage.\nHitachi Vantara\nis bringing AI Data Platform into the Hitachi IQ ecosystem, helping customers innovate with storage systems and data offerings that drive tangible AI outcomes.\nIBM\nis integrating AI Data Platform as part of its content-aware storage capability with IBM Fusion and IBM Storage Scale technology to accelerate retrieval-augmented generation applications.\nNetApp\nis advancing enterprise storage for agentic AI with the NetApp AIPod solution built with AI Data Platform.\nNutanix\nCloud Platform with Nutanix Unified Storage will integrate with the NVIDIA AI Data Platform and enable inferencing and agentic workflows deployed across edge, data center and public cloud.\nPure Storage\nwill deliver AI Data Platform capabilities with Pure Storage FlashBlade.\nVAST Data\nis working with AI Data Platform to curate real-time insights with VAST InsightEngine.\nWEKA\nData Platform software integrates with NVIDIA GPUs, DPUs and networking to optimize data access for agentic AI reasoning and insights and deliver a high-performance storage foundation that accelerates AI inference and token processing workloads.\nNVIDIA-Certified Storage providers are planning to offer solutions created with the NVIDIA AI Data platform starting this month.\nLearn more by watching the\nNVIDIA GTC keynote\nand\nregister for sessions\nfrom NVIDIA and industry leaders at the show, which runs through March 21"}
{"spider": "nvidia", "url": "https://nvidianews.nvidia.com/news/nvidia-to-build-accelerated-quantum-computing-research-center", "title": "NVIDIA to Build Accelerated Quantum Computing Research Center", "date": "2025-03-18 00:00:00", "content": "GTC—\nNVIDIA today announced it is building a Boston-based research center to provide cutting-edge technologies to advance quantum computing.\nThe NVIDIA Accelerated Quantum Research Center, or\nNVAQC\n, will integrate leading quantum hardware with AI supercomputers, enabling what is known as accelerated quantum supercomputing. The NVAQC will help solve quantum computing’s most challenging problems, ranging from qubit noise to transforming experimental quantum processors into practical devices.\nLeading quantum computing innovators, including\nQuantinuum\n, Quantum Machines and\nQuEra Computing\n, will tap into the NVAQC to drive advancements through collaborations with researchers from leading universities, such as the Harvard Quantum Initiative in Science and Engineering (HQI) and the Engineering Quantum Systems (EQuS) group at the Massachusetts Institute of Technology (MIT).\n“Quantum computing will augment AI supercomputers to tackle some of the world’s most important problems, from drug discovery to materials development,” said Jensen Huang, founder and CEO of NVIDIA. “Working with the wider quantum research community to advance CUDA-quantum hybrid computing, the NVIDIA Accelerated Quantum Research Center is where breakthroughs will be made to create large-scale, useful, accelerated quantum supercomputers.”\nPropelling Quantum Innovation\nThrough the NVAQC, commercial and academic partners will work with NVIDIA to use state-of-the-art NVIDIA GB200 NVL72 rack-scale systems, the most powerful hardware ever deployed for quantum computing applications. This enables complex simulations of quantum systems and the deployment of the low-latency quantum hardware control algorithms essential for quantum error correction. NVIDIA GB200 NVL72 systems will also accelerate the adoption of AI algorithms in quantum computing research.\nTo address the challenges of integrating GPU and QPU hardware, the NVAQC will employ the\nNVIDIA CUDA-Q™\nquantum development platform, enabling researchers to develop new hybrid quantum algorithms and applications.\nThe HQI — a community of researchers dedicated to advancing the science and engineering of quantum systems and their applications — will collaborate with the NVAQC to advance their research on next-generation quantum computing technologies.\n“The NVAQC is a very special addition to the unique Boston area quantum ecosystem, including world-leading university groups and startup companies,” said Mikhail Lukin, Joshua and Beth Friedman University Professor at Harvard and a co-director of HQI. “The accelerated quantum and classical computing technologies NVIDIA is bringing together has the potential to advance the research in areas ranging from quantum error correction to applications of quantum computing systems, accelerating quantum computing research and pulling useful quantum computing closer to reality.”\nResearchers from the EQuS group, a member of the MIT Center for Quantum Engineering — which serves as a hub for research, education and engagement in support of quantum engineering — will use NVAQC to develop techniques like quantum error correction.\n“The NVIDIA Accelerated Quantum Research Center will provide EQuS group researchers with unprecedented access to the technologies and expertise needed to solve the challenges of useful quantum computing,” said William Oliver, professor of electrical engineering and computer science, and of physics, leader of the EQuS group and director of the MIT Center for Quantum Engineering. “We anticipate the future will also include other members of the Center for Quantum Engineering at MIT. Integrating the NVIDIA accelerated computing platform with qubits will help tackle core challenges like quantum error correction, hybrid application development and quantum device characterization.”\nThe NVAQC is expected to begin operations later this year.\nLearn more about NVIDIA’s quantum computing initiatives and hear from industry leaders by joining\nQuantum Day\nat NVIDIA GTC, which runs through March 21."}
{"spider": "nvidia", "url": "https://nvidianews.nvidia.com/news/nvidia-earth-2-climate-tech-weather-prediction-disaster-preparedness", "title": "Climate Tech Companies Adopt NVIDIA Earth-2 for High-Resolution, Energy-Efficient, More Accurate Weather Predictions and Disaster Preparedness", "date": "2025-03-18 00:00:00", "content": "GTC—\nNVIDIA today announced the\nNVIDIA Omniverse Blueprint for Earth-2 weather analytics\nto accelerate the development of more accurate weather forecasting solutions.\nClimate-related weather events have had a $2 trillion\nimpact\non the global economy over the last decade. The new Omniverse Blueprint equips users with the latest technologies to help global organizations improve risk management and disaster preparedness.\nThe NVIDIA Omniverse Blueprint for Earth-2 weather analytics offers reference workflows — including NVIDIA GPU acceleration libraries, a physics-AI framework, development tools and microservices — to help enterprises go from prototyping to production with weather forecast models.\nEasy-to-deploy NVIDIA NIM™ microservices for NVIDIA Earth-2 are also part of the blueprint, including CorrDiff for downscaling and FourCastNet for predicting global atmospheric dynamics of various weather and climate variables. These are already being used by weather technology companies, researchers and government agencies to derive insights and mitigate risk from extreme weather events.\n“We’re seeing more extreme weather events and natural disasters than ever, threatening lives and property,” said Jensen Huang, founder and CEO of NVIDIA. “The NVIDIA Omniverse Blueprint for Earth-2 will help industries around the world prepare for — and mitigate — climate change and weather-related disasters.”\nEcosystem Support\nIndustry-leading climate tech companies including AI company G42, JBA Risk Management, Spire and others are using the blueprint to develop unique AI-augmented solutions.\nWhen combined with proprietary enterprise data in the $20 billion climate tech industry, the NVIDIA Earth-2 platform helps developers build solutions that deliver warnings and updated forecasts in seconds rather than minutes or hours with traditional CPU-driven modeling.\nG42 is integrating various components of the Omniverse Blueprint with its own AI-driven forecasting models for Earth-2 to provide the UAE’s National Center of Meteorology with AI technologies for advanced weather forecasting and disaster management.\n“G42 is advancing AI-powered forecasting to help governments and enterprises strengthen resilience against extreme weather in a rapidly changing world,” said Andrew Jackson, CEO of Inception, a G42 company. “Using high-resolution weather and climate modeling, we are transforming how organizations anticipate and respond to severe weather conditions with precision and speed. Building on NVIDIA’s CorrDiff model, we have developed a custom AI-driven system that downscales coarse weather data into hyper-local forecasts, enabling faster predictions at an unprecedented scale. Combined with the Earth-2 Blueprint, this technology equips decision-makers with actionable intelligence to protect communities, safeguard infrastructure and plan for a more resilient future.”\nSpire Global used AI components from the blueprint as reference to develop new AI products that integrate its proprietary satellite data and deliver medium-range and sub-seasonal forecasts out to 45 days. Powered by NVIDIA GPUs and the Omniverse Blueprint for Earth-2, Spire’s models run 1,000x faster than traditional physics-based models, enabling large ensemble forecasts that capture the full range of possible weather outcomes.\nIn addition to the Central Weather Administration of Taiwan and The Weather Company, other companies adopting or exploring Earth-2 include 3D mapping company Ecopia, spatial analytics company ESRI, green energy company GCL Power, flood risk management company JBA Risk Management, aerospace company OroraTech, and Tomorrow.io, a leading resilience platform powered by proprietary space data and weather intelligence.\nGroundbreaking Generative AI for Climate Tech\nThe Earth-2 platform offers tools, microservices and an array of state-of-the-art AI weather models for visualizing and simulating the globe.\nCorrDiff\n, part of the Omniverse Blueprint, is available as an\nNVIDIA NIM microservice\n. Compared with CPUs, it can be 500x faster and 10,000x more energy-efficient in delivering high-resolution numerical weather predictions.\nThe Omniverse Blueprint for Earth-2 allows independent software vendors to develop and deploy AI-augmented solutions and use observational data to make their solutions faster and more accurate.\nEsri, a leader in geospatial technology, is collaborating with NVIDIA to connect its ArcGIS platform to Earth-2 through the blueprint. OroraTech is exploring connecting its data platform to the Omniverse Blueprint for Earth-2.\nTomorrow.io contributed its near-real-time proprietary satellite data to help create an NVIDIA digital twin of Earth for next-generation AI model training, inference and reinforcement.\nA key component of the new blueprint is\nNVIDIA Omniverse\n™, a platform for developing OpenUSD-based 3D workflows and applications. The Omniverse Blueprint for Earth-2 showcases how developers can use Omniverse software development kits and microservices to build NVIDIA RTX™-powered visualization pipelines for rendering geospatial and weather data.\nNVIDIA DGX Cloud-Powered Compute\nThe Omniverse Blueprint for Earth-2 taps into the\nNVIDIA DGX™ Cloud\nplatform to demonstrate full-stack acceleration for AI-augmented weather forecasting. Running on NVIDIA DGX GB200, NVIDIA HGX™ B200 and NVIDIA OVX™ supercomputers, the blueprint provides a path to simulating and visualizing the global climate simulations at exceptional speed and scale.\nLearn more by watching the\nNVIDIA GTC keynote\nand\nregister for sessions\nfrom NVIDIA and industry leaders at the show, which runs through March 21."}
{"spider": "nvidia", "url": "https://nvidianews.nvidia.com/news/nvidia-and-ge-healthcare-collaborate-to-advance-the-development-of-autonomous-diagnostic-imaging-with-physical-ai", "title": "NVIDIA and GE HealthCare Collaborate to Advance the Development of Autonomous Diagnostic Imaging With Physical AI", "date": "2025-03-18 00:00:00", "content": "GTC—\nNVIDIA today announced a collaboration with GE HealthCare to advance innovation in autonomous imaging, focused on developing autonomous X-ray technologies and ultrasound applications.\nBuilding autonomy into systems like X-ray and ultrasound requires medical imaging systems to understand and operate in the physical world. This enables the automation of complex workflows such as patient placement, image scanning and quality checking.\nTo accomplish this, GE HealthCare, a pioneering partner, is using the new NVIDIA Isaac™ for Healthcare medical device simulation platform, which includes pretrained models and physics-based simulations of sensors, anatomy and environments. The platform accelerates research and development workflows, enabling GE HealthCare to train, test and validate autonomous imaging system capabilities in a virtual environment before deployment in the physical world.\n“The healthcare industry is one of the most important applications of AI, as the demand for healthcare services far exceeds the supply,” said Kimberly Powell, vice president of healthcare at NVIDIA. “We are working with an industry leader, GE HealthCare, to deliver Isaac for Healthcare, three computers to give lifesaving medical devices the ability to act autonomously and extend access to healthcare globally.”\nExpanding Access to Imaging With Physical AI\nUltrasounds and X-ray are the most common and widely used diagnostic imaging systems, yet nearly two-thirds of the global population lack access. Enhancing imaging systems with robotic capabilities will help expand access to care.\nNVIDIA and GE HealthCare have been working together for nearly two decades, building innovative image-reconstruction techniques across CT and MRI, image-guided therapy and mammography.\n“GE HealthCare is committed to developing innovative technologies that redefine and enhance patient care,” said Roland Rott, president and CEO of Imaging at GE HealthCare. “We look forward to taking advantage of physical AI for autonomous imaging systems with NVIDIA technology to improve patient access and address the challenges of growing workloads and staffing shortages in healthcare.”\nIsaac for Healthcare Closes Gap Between Simulation and Reality\nNVIDIA will also support other customers with Isaac for Healthcare for use cases including simulation environments. Simulation environments enable robotic systems to safely learn skills in a physically accurate virtual environment for real-world situations, such as surgery, that would otherwise be impossible to replicate.\nIsaac for Healthcare is a physical AI platform built on NVIDIA’s three computers for robotics:\nNVIDIA DGX\n™,\nNVIDIA Omniverse\n™ and\nNVIDIA Holoscan\n. It includes AI models fine-tuned for healthcare robotics that can understand, act and see using enhanced vision and language processing. It also has a simulation framework for developers to accurately simulate medical environments and provides seamless deployment on NVIDIA Holoscan, an edge AI computing platform, to power robotic decision-making in the real world, in real time.\nSimulation options for medical sensors are often limited. With Isaac for Healthcare, developers can now access physics-based\ndigital twins\nof medical environments, allowing them to import custom sensors, instruments and even anatomies to teach robots how to respond to various scenarios. These virtual environments help close the gap between simulation and real-world implementation, and enable rapid digital prototyping.\nIsaac for Healthcare allows for multi-scale simulation ranging from microscopic structures and surgery suites to full hospital facilities. Easy policy training in simulation allows robotic systems to learn how to respond in various medical scenarios in the operating room, and how to best support physician decision-making and patient care.\nHealthcare Robotics Ecosystem Rapidly Expands\nIsaac for Healthcare can help speed the development of robotic healthcare solutions by simulating complex medical scenarios, training AI models and optimizing robotic applications like surgery, endoscopy and cardiovascular interventions. Early adopters include Moon Surgical, Neptune Medical and Xcath.\nIsaac for Healthcare is enabling ecosystem partners to seamlessly integrate their simulation tools, sensors, robot systems and medical probes into a domain-specific simulation environment. Among early ecosystem partners are Ansys, Franka, ImFusion, Kinova and Kuka.\nIssac for Healthcare is now available in early access."}
{"spider": "nvidia", "url": "https://nvidianews.nvidia.com/news/oracle-and-nvidia-collaborate-to-help-enterprises-accelerate-agentic-ai-inference", "title": "Oracle and NVIDIA Collaborate to Help Enterprises Accelerate Agentic AI Inference", "date": "2025-03-18 00:00:00", "content": "GTC—\nOracle and NVIDIA today announced a first-of-its-kind integration between NVIDIA accelerated computing and inference software with Oracle’s\nAI infrastructure\n, and\ngenerative AI services\n, to help organizations globally speed creation of agentic AI applications.\nThe new integration between Oracle Cloud Infrastructure (OCI) and the\nNVIDIA AI Enterprise\nsoftware platform will make 160+ AI tools and 100+ NVIDIA NIM™ microservices natively available through the OCI Console. In addition, Oracle and NVIDIA are collaborating on the no-code deployment of both Oracle and\nNVIDIA AI Blueprints\nand on accelerating AI vector search in Oracle Database 23ai with the\nNVIDIA cuVS library\n.\n“Oracle has become the platform of choice for both AI training and inferencing, and this partnership enhances our ability to help customers achieve greater innovation and business results,” said Safra Catz, CEO of Oracle. “NVIDIA’s offerings, paired with OCI’s flexibility, scalability, performance and security, will speed AI adoption and help customers get more value from their data.”\n“Oracle and NVIDIA are perfect partners for the age of reasoning — an AI and accelerated computing company working with a key player in processing much of the world’s enterprise data,” said Jensen Huang, founder and CEO of NVIDIA. “Together, we help enterprises innovate with agentic AI to deliver amazing things for their customers and partners.”\nPurpose-Built Solutions to Meet Enterprise AI Needs\nReducing the time it takes to deploy reasoning models, NVIDIA AI Enterprise will be natively available through the OCI Console, enabling customers to quickly and easily access AI tools including NVIDIA NIM — a set of 100+ optimized, cloud-native inference microservices for leading AI models, including the latest NVIDIA Llama Nemotron models for advanced AI reasoning.\nNVIDIA AI Enterprise will be available as a deployment image for OCI bare-metal instances and Kubernetes clusters using OCI Kubernetes Engine. OCI Console customers benefit from direct billing and customer support through Oracle.\nOrganizations can deploy OCI’s 150+ AI and cloud services with NVIDIA accelerated computing and NVIDIA AI Enterprise in the data center, the public cloud or at the edge. This offering provides an integrated AI stack to help address data privacy, sovereign AI and low-latency requirements.\nBiotechnology company Soley Therapeutics is deploying OCI AI Infrastructure, NVIDIA AI Enterprise and NVIDIA Blackwell GPUs to build its AI drug discovery platform to unlock possible treatments for complex diseases by capturing, decoding and interpreting cellular language to forecast cell fate.\n“We believe in the potential of AI in developing new solutions that can help deliver treatments for cancer and other complex diseases,” said Yerem Yeghiazarians, cofounder and CEO of Soley Therapeutics. “The combination of OCI and NVIDIA delivers a full-stack AI solution, providing us the storage, compute, software tools and support necessary to innovate faster with petabytes of data in developing our AI drug discovery platform.”\nAI Deployment at Scale With Tailored Blueprints\nOCI AI Blueprints\nprovide no-code deployment recipes that enable customers to quickly run AI workloads without having to make decisions about the software stack or manually provision the infrastructure. The blueprints offer clear hardware recommendations for NVIDIA GPUs, NIM microservices and prepackaged observability tools, helping enterprises accelerate their AI projects from weeks to minutes.\nIn addition,\nNVIDIA Blueprints\nprovide developers with a unified experience across the NVIDIA stack, providing reference workflows for enterprise AI use cases. Using NVIDIA Blueprints, organizations can build and operationalize custom AI applications with NVIDIA AI Enterprise and\nNVIDIA Omniverse\n™ software, application programming interfaces and microservices. For example, developers can begin with an NVIDIA AI Blueprint for a customer service AI assistant and customize it for their own use.\nTo simplify the development, deployment and scale-out of advanced physical AI and simulation applications and workflows, the NVIDIA Omniverse platform and NVIDIA Isaac Sim™ development workstations and Omniverse Kit App Streaming are expected to be available on Oracle Cloud Infrastructure Marketplace later this year, preconfigured with compute bare-metal instances accelerated by NVIDIA L40S GPUs.\nPipefy, an AI-powered automation platform for business process management, uses an inference blueprint for document preprocessing and image processing.\n“We embraced OCI AI Blueprints to spin up NVIDIA GPU nodes and deploy multimodal large language models quickly for document- and image-processing use cases,” said Gabriel Custodio, principal software engineer at Pipefy. “Using these prepackaged and verified blueprints, deploying our AI models on OCI is now fully automated and significantly faster.”\nReal-Time AI Inference With NVIDIA NIM in OCI Data Science\nTo further accelerate enterprise AI adoption and help enable quick AI deployments with minimal setup, data scientists can access pre-optimized NVIDIA NIM microservices directly in OCI Data Science. This supports real-time AI inference use cases without the complexity of managing infrastructure.\nTo help maintain data security and compliance, the models run in the customer’s OCI tenancy. Customers can purchase the models through a flexible, pay-as-you-go, hourly pricing model or apply their Oracle Universal Credits.\nOrganizations can use this integration to deploy inference endpoints with preconfigured, optimized NIM inference engines in minutes, rapidly accelerating time to value for use cases such as AI-powered assistants, real-time recommendation engines and copilots. In addition, this allows customers to start using the integration for smaller workloads and seamlessly scale to enterprise-wide deployments.\nNVIDIA Accelerated Computing Platform Turbocharges AI Vector Search in Oracle Database 23ai\nOracle and NVIDIA are working together to accelerate the creation of vector embeddings and vector indexes — compute-intensive portions of AI Vector Search workloads in Oracle Database 23ai — using NVIDIA GPUs and NVIDIA cuVS.\nOrganizations can enable vector embedding through bulk vectorization of large volumes of input data such as text, images and videos, as well as the fast creation and maintenance of vector indexes. With NVIDIA-accelerated AI Vector Search, Oracle Database customers can significantly improve the performance of their AI pipelines to help support high-volume AI vector workloads.\nDeweyVision provides advanced computer vision and artificial intelligence capabilities to turn media into data, making it accessible, searchable, discoverable, retrievable and actionable. DeweyVision uses Oracle Database 23ai on Oracle Autonomous Database for its AI-powered, no-code warehousing tools. These tools enable production professionals to connect their workflows and edit video footage quickly by cataloging footage in minutes and providing intuitive search capabilities.\n“Oracle Database 23ai with AI Vector Search can significantly increase Dewey’s search performance while increasing the scalability of the DeweyVision platform,” said Majid Bemanian, CEO of DeweyVision. “Using NVIDIA GPUs to create the vector embeddings that we load into Oracle Database accelerates our platform’s ingestion of new data, while Autonomous Database and the converged capabilities of Oracle Database 23ai will help reduce our operational costs as we grow and open new opportunities. We believe that the combination of DeweyVision, Oracle Database 23ai and NVIDIA GPUs running in OCI will help us achieve our goal of becoming Hollywood’s data warehouse.”\nNVIDIA Blackwell on OCI Enables AI Anywhere\nOracle and NVIDIA continue to evolve AI infrastructure with new NVIDIA GPU types across OCI’s public regions, government clouds, sovereign clouds, OCI Dedicated Region, Oracle Alloy, OCI Compute Cloud@Customer and OCI Roving Edge Devices.\nThis includes\nNVIDIA Quantum-2 InfiniBand\ncluster network environments,\nNVIDIA Spectrum\n™ Ethernet switches and optimized NVIDIA NVLink™ and NVLink Switch functionality for some of the largest AI superclusters in the market.\nOCI will offer NVIDIA GB200 NVL72 systems on\nOCI Supercluster\n— generally available soon with up to 131,072 NVIDIA GPUs — and is taking orders for one of the largest AI supercomputers in the cloud with NVIDIA Blackwell Ultra GPUs.\nOCI will be among the first cloud service providers to offer the next generation of the NVIDIA Blackwell accelerated computing platform. Built on the groundbreaking Blackwell architecture introduced a year ago, Blackwell Ultra includes the NVIDIA GB300 NVL72 rack-scale solution and the NVIDIA HGX™ B300 NVL16 system. The GB300 NVL72 delivers 1.5x more AI performance than the NVIDIA GB200 NVL72, as well as increases Blackwell’s revenue opportunity by 50x for AI factories, compared with those built with NVIDIA Hopper™.\nSoundHound, a global leader in conversational intelligence, offers voice and conversational AI solutions, powering voice-related experiences in millions of products from global brands. Its voice AI platform runs on OCI, processing billions of queries annually, and uses NVIDIA GPUs to provide customers with fast and accurate voice services.\n“SoundHound has developed a long-term relationship with OCI, and we believe our ongoing collaboration will play a key role in supporting future growth,” said James Hom, chief product officer of SoundHound AI. “NVIDIA GPUs will greatly accelerate training for our next generation of voice AI.”\nAdditional Resources\nLearn more about\nOCI AI infrastructure\n.\nLearn more about\nOracle Cloud Infrastructure\n.\nLearn more about\nOracle expanding its distributed cloud capabilities with NVIDIA AI Enterprise\n.\nLearn more about\nOCI AI infrastructure for OCI Dedicated Region and Oracle Alloy\n.\nRead the OCI Supercluster\ntechnical blog\nand watch the\nvideo\n.\nAbout Oracle Distributed Cloud\nOracle’s distributed cloud delivers the benefits of cloud with greater control and flexibility. Oracle’s distributed cloud lineup includes:\nPublic cloud\n: Hyperscale public cloud regions serve any size of organization, including those requiring strict EU sovereignty controls. See the\nfull list of regions\n.\nDedicated cloud\n: Customers can run all OCI cloud services in their own data centers with OCI Dedicated Region, while partners can resell OCI cloud services and customize the experience using Oracle Alloy. Oracle also operates separate U.S., U.K. and Australian government clouds, as well as isolated cloud regions for national security purposes. Each of these products provides a full cloud and AI stack that customers can deploy as a sovereign cloud.\nHybrid cloud\n: OCI delivers key cloud services on-premises via Oracle Exadata Cloud@Customer and Compute Cloud@Customer and is already managing deployments in over 60 countries. Additionally, OCI Roving Edge Infrastructure, which consists of multiple configurations of ruggedized and portable high-performance devices, helps customers leverage remote AI inferencing at the edge.\nMulticloud\n: OCI is physically deployed within all the hyperscale cloud providers, including AWS, Google Cloud and Microsoft Azure, providing low-latency, natively integrated Oracle database services, including Oracle Database@AWS, Oracle Database@Azure, Oracle Database@Google Cloud and Oracle HeatWave on AWS. Oracle Interconnect for Microsoft Azure and Oracle Interconnect for Google Cloud allows customers to combine key capabilities from across clouds."}
{"spider": "nvidia", "url": "https://nvidianews.nvidia.com/news/nvidia-alphabet-and-google-collaborate-on-the-future-of-agentic-and-physical-ai", "title": "NVIDIA, Alphabet and Google Collaborate on the Future of Agentic and Physical AI", "date": "2025-03-18 00:00:00", "content": "GTC—\nBuilding on their longstanding partnership, NVIDIA, Alphabet and Google today announced new initiatives to advance AI, democratize access to AI tools, speed the development of physical AI and transform industries including healthcare, manufacturing and energy.\nEngineers and researchers throughout Alphabet are working closely with technical teams at NVIDIA to use AI and simulation to develop robots with grasping skills, reimagine drug discovery, optimize energy grids and more. Employing the\nNVIDIA Omniverse™\n,\nNVIDIA Cosmos™\nand\nNVIDIA Isaac™\nplatforms, teams from Google DeepMind, Isomorphic Labs, Intrinsic and X’s moonshot Tapestry will discuss milestones from their respective collaborations at the NVIDIA GTC global AI conference.\nTo power research and AI production efforts for its customers, Alphabet’s Google Cloud will be among the first to adopt the NVIDIA GB300 NVL72 rack-scale solution and NVIDIA RTX PRO™ 6000 Blackwell Server Edition GPU, also announced today at GTC.\nNVIDIA will be the first industry partner to adopt\nSynthID\n, a Google DeepMind AI technology that embeds digital watermarks directly into AI-generated images, audio, text or video.\n“I’m proud of our ongoing and deep partnership with NVIDIA, which spans the early days of Android and our cutting-edge AI collaborations across Alphabet,” said Sundar Pichai, CEO of Google and Alphabet. “I’m really excited about the next phase of our partnership as we work together on agentic AI, robotics and bringing the benefits of AI to more people around the world.”\n“Alphabet and NVIDIA have a longstanding partnership that extends from building AI infrastructure and software to advancing the use of AI in the largest industries,” said Jensen Huang, founder and CEO of NVIDIA. “It’s a great joy to see Google and NVIDIA researchers and engineers collaborate to solve incredible challenges, from drug discovery to robotics.”\nDeveloping Responsible AI and Open Models\nGoogle DeepMind and NVIDIA are working to build trust in generative AI through content transparency.\nNVIDIA will be the first external user of Google DeepMind’s\nSynthID\n, which embeds digital watermarks directly into AI-generated images, audio, text and video. SynthID helps preserve the integrity of outputs from NVIDIA Cosmos world foundation models, available on\nbuild.nvidia.com\n, helping to safeguard against misinformation and misattribution — all without compromising video quality.\nGoogle DeepMind and NVIDIA also partnered to optimize Gemma, Google’s family of lightweight, open models, to run on NVIDIA GPUs. The recent launch of\nGemma 3\nmarks a significant leap forward for open innovation.\nNVIDIA has played a key role in making Gemma even more accessible for developers. Supercharged by the NVIDIA AI platform, Gemma is available as a highly optimized NVIDIA NIM™ microservice, harnessing the power of the open-source NVIDIA TensorRT-LLM library for exceptional inference performance.\nIn addition, this deep engineering collaboration will extend to optimizing Gemini-based workloads on NVIDIA accelerated computing via Vertex AI.\nThe Age of Intelligent Robots\nIntrinsic\nis an Alphabet company focused on making intelligently adaptive AI for robotics usable and valuable for manufacturers across industries. Today, the majority of the world’s installed industrial robots are manually programmed, with every movement hard-coded in a complex, expensive process.\nPartnering with NVIDIA, the teams have built deeper and more intuitive developer workflows for Intrinsic Flowstate to support NVIDIA Isaac Manipulator foundation models for a universal robot grasping capability. Using foundation models for robotics will significantly reduce application development time and improve flexibility, with AI that can adapt effortlessly. At GTC, Intrinsic will also share an early OpenUSD framework streaming connection between Intrinsic Flowstate and NVIDIA Omniverse — enabling real-time visualization of robot workcells across platforms.\nConcurrently, NVIDIA and Google DeepMind are announcing a collaboration with Disney Research to develop\nNewton\n, an open-source physics engine accelerated by the\nNVIDIA Warp\nframework that is compatible with MuJoCo. Powered by Newton, MuJoCo will accelerate robotics machine learning workloads by more than 70x compared with MuJoCo’s existing GPU-accelerated simulator, MJX.\nApplying Innovation to Real-World Challenges\nIsomorphic Labs\n, founded by Google DeepMind CEO Demis Hassabis, is reimagining drug discovery with AI. It has built a state-of-the-art drug design engine housed on Google Cloud with NVIDIA GPUs to enable the scale and performance needed to continue developing groundbreaking AI models that can help advance human health.\nTapestry\n, X’s moonshot for the electric grid, is building AI-powered products for a greener and more reliable future grid. Tapestry and NVIDIA are exploring methods for increasing the speed and accuracy of electric grid simulations.\nThis joint effort will focus on the challenges of integrating new energy sources and expanding grid capacity to meet the growing demands of data centers and AI, while helping ensure grid stability. The companies will evaluate potential solutions, including using AI to optimize the interconnection process, with the goal of enhancing the planning and modernization of energy infrastructure for a more sustainable future.\nThe Next Generation of AI-Optimized Infrastructure\nBuilding on its commitment to provide customers with the most advanced AI infrastructure, Google Cloud will be one of the first companies to offer the latest instances of NVIDIA Blackwell GPUs — NVIDIA GB300 NVL72 and NVIDIA RTX PRO 6000 Blackwell Server Edition.\nBuilt on the groundbreaking Blackwell architecture introduced a year ago, Blackwell Ultra includes the NVIDIA GB300 NVL72 rack-scale solution and the NVIDIA HGX™ B300 NVL16 system. The GB300 NVL72 delivers 1.5x more AI performance than the NVIDIA GB200 NVL72, as well as increases Blackwell’s revenue opportunity by 50x for AI factories, compared with those built with NVIDIA Hopper™. NVIDIA RTX PRO 6000 Blackwell is the ultimate universal GPU for both AI and visual computing workloads across healthcare, manufacturing, retail, live broadcast and other industries.\nWith last month’s preview launches of its\nA4\nand\nA4X\nvirtual machines, Google Cloud became the first cloud provider to offer both NVIDIA B200- and GB200-based instances. Now, A4 is generally available — with A4X coming soon — so customers can take advantage of Blackwell’s powerful performance with the added benefits of Google Cloud’s\nAI Hypercomputer\n.\nGoogle Cloud and NVIDIA\nhave worked together to optimize popular open-source frameworks like JAX, a popular Python library for machine learning, and MaxText to run efficiently on NVIDIA GPUs at scale. MaxText, an advanced framework for scaling large models across massive GPU clusters, uses optimizations codeveloped with NVIDIA to enable efficient training on tens of thousands of GPUs.\nGTC attendees interested in learning more about Alphabet and NVIDIA’s work can visit the Google Cloud booth 914."}
{"spider": "nvidia", "url": "https://nvidianews.nvidia.com/news/nvidia-sets-conference-call-for-first-quarter-financial-results-6910262", "title": "NVIDIA Sets Conference Call for First-Quarter Financial Results", "date": "2025-04-30 00:00:00", "content": "SANTA CLARA, Calif., April 30, 2025 -- NVIDIA will host a conference call on Wednesday, May 28, at 2 p.m. PT (5 p.m. ET) to discuss its financial results for the first quarter of fiscal year 2026, which ended April 27, 2025.\nThe call will be webcast live (in listen-only mode) on\ninvestor.nvidia.com\n. The company’s prepared remarks will be followed by a Q&A session, which will be limited to questions from financial analysts and institutional investors.\nAhead of the call, NVIDIA will provide written commentary on its first-quarter results from Colette Kress, the company's executive vice president and chief financial officer. This material will be posted to\ninvestor.nvidia.com\nimmediately after the company’s results are publicly announced at approximately 1:20 p.m. PT.\nThe webcast will be recorded and available for replay until the company’s conference call to discuss financial results for its second quarter of fiscal year 2026."}
{"spider": "nvidia", "url": "https://nvidianews.nvidia.com/news/nvidia-blackwell-geforce-rtx-arrives-for-every-gamer-starting-at-299", "title": "NVIDIA Blackwell GeForce RTX Arrives for Every Gamer, Starting at $299", "date": "2025-04-15 00:00:00", "content": "NVIDIA today announced the NVIDIA GeForce RTX™ 5060 family of GPUs, including two graphics cards that deliver neural rendering and NVIDIA Blackwell architecture innovations for every gamer — starting at just $299.\nThe GeForce RTX 5060 Ti and RTX 5060 graphics cards feature\nNVIDIA DLSS 4\n, full ray tracing, neural rendering and\nNVIDIA Reflex\ntechnologies for exceptional performance and image quality.\n“The RTX 5060 family offers gamers next-generation performance and AI-enhanced visuals starting at $299,” said Matt Wuebbling, vice president of GeForce marketing at NVIDIA. “Powered by the advanced NVIDIA Blackwell architecture and featuring DLSS 4 technology in over 100 games, this new class of GPUs elevates gaming with stunning visuals, high frame rates and quick responsiveness.”\nDLSS 4 Now in 100+ Games\nThe GeForce RTX 5060 family includes DLSS 4 capabilities such as Multi Frame Generation and Super Resolution, as well as NVIDIA Reflex to reduce latency. More than 100 games now feature these AI-powered enhancements. Blockbuster titles like\nAlan Wake 2\n,\nBlack Myth: Wukong, Cyberpunk 2077\nand\nHogwarts Legacy\nboast stunning ray-traced visuals at over 100 frames per second (fps) on maximum settings.\nBoosting Creative Workflows\nThe RTX 5060 family can also serve as a powerful companion for creators. Equipped with Blackwell FP4 Tensor Cores and ninth-generation\nNVIDIA NVENC\nencoders, the GPUs can enhance creative workflows for livestreamers, video editors, 3D artists and others.\nIntroducing GeForce RTX 5060 Laptops\nIn addition, the GeForce RTX 5060 Laptop GPU has arrived, bringing enhanced gaming and creative capabilities to laptops. Built with the Blackwell architecture and DLSS 4, the GPU ensures every gamer and creator can enjoy 144 fps and 8K 4:2:2 color format video editing. GeForce RTX 5060 laptops can deliver double the frame rates and lower latency compared with previous-generation models — and are coming in a broad range of designs and sizes as thin as 14.9 millimeters.\nAvailability\nGeForce RTX 5060 Ti graphics cards, equipped with 16GB or 8GB graphics memory, will be available starting April 16 at $429 and $379, respectively.\nGeForce RTX 5060 graphics cards will be available starting in May at $299.\nStock-clocked and factory-overclocked models will be available from top add-in card providers such as ASUS, Colorful, Gainward, GALAX, GIGABYTE, INNO3D, KFA2, MSI, Palit, PNY and ZOTAC, and in desktops from system builders including Falcon Northwest, Infiniarc, MAINGEAR, Mifcom, ORIGIN PC, PC Specialist and Scan Computers.\nLaptops equipped with GeForce RTX 5060 laptop GPUs will be available from every major manufacturer beginning in May, starting at $1,099.\nFind full specifications and additional details on the\nNVIDIA GeForce webpage\n."}
{"spider": "nvidia", "url": "https://nvidianews.nvidia.com/news/humain-and-nvidia-announce-strategic-partnership-to-build-ai-factories-of-the-future-in-saudi-arabia", "title": "HUMAIN and NVIDIA Announce Strategic Partnership to Build AI Factories of the Future in Saudi Arabia", "date": "2025-05-13 00:00:00", "content": "HUMAIN, the new full AI value chain subsidiary of Saudi Arabia’s Public Investment Fund, today announced a landmark strategic partnership with NVIDIA, the world leader in AI computing infrastructure, to drive the next wave of artificial intelligence development.\nThe two organizations will leverage NVIDIA platforms and expertise to establish Saudi Arabia as a global leader in AI, GPU cloud computing and digital transformation to drive innovation and growth worldwide.\nThe partnership underscores HUMAIN’s mission to position Saudi Arabia as an international AI powerhouse — combining cutting-edge infrastructure, frontier AI models, immersive digital platforms and human capital development.\nPowering AI Factories of Tomorrow\nHUMAIN is making a major investment to build AI factories in the Kingdom of Saudi Arabia with a projected capacity of up to 500 megawatts powered by several hundred thousand of NVIDIA’s most advanced GPUs over the next five years. The first phase of deployment will be an 18,000 NVIDIA GB300 Grace Blackwell AI supercomputer with NVIDIA InfiniBand networking.\nThese hyperscale AI data centers will provide a secure foundational infrastructure for training and deploying sovereign AI models at scale, enabling industries across Saudi Arabia and worldwide to accelerate innovation and digital transformation.\nUnlocking the Era of Physical AI With NVIDIA Omniverse\nHUMAIN will deploy the\nNVIDIA Omniverse™\nplatform as a multi-tenant system to drive acceleration of the new era of physical AI and robotics through simulation, optimization and operation of physical environments by new human-AI-led solutions. This will allow industries such as manufacturing, logistics and energy to create fully integrated digital twins, boosting efficiency, safety and sustainability while fast-tracking the Kingdom’s journey toward Industry 4.0.\nEnabling the Kingdom’s AI Ecosystem Through Workforce Transformation\nTo support this transformation, HUMAIN and NVIDIA will collaborate on large-scale upskilling and training initiatives, providing thousands of Saudi citizens and developers with hands-on experience in advanced AI, simulation, robotics and digital twin technologies. This effort will contribute to building a robust national AI ecosystem and align with Saudi Arabia’s Vision 2030 goals of economic diversification and digital leadership.\n“AI, like electricity and internet, is essential infrastructure for every nation,” said Jensen Huang, founder and CEO of NVIDIA. “Together with HUMAIN, we are building AI infrastructure for the people and companies of Saudi Arabia to realize the bold vision of the Kingdom.”\n“We thank NVIDIA for their strategic partnership with the Kingdom. This collaboration with HUMAIN marks a turning point, building the AI factories of the future, unlocking compute and powering the next era of physical AI,” said His Excellency Eng. Abdullah Alswaha, Minister of Communications and Information Technology. “This lays the groundwork for a new industrial revolution, anchored in advanced infrastructure, talent and global ambition. This is how Saudi Arabia continues to lead as a partner of choice in shaping the future of AI.”\n“Our partnership with NVIDIA is a bold step forward in realizing the Kingdom’s ambitions to lead in AI and advanced digital infrastructure,” said Tareq Amin, CEO of HUMAIN. “Together, we are building the capacity, capability and a new globally enabled community to shape a future powered by intelligent technology and empowered people.”"}
{"spider": "nvidia", "url": "https://nvidianews.nvidia.com/news/saudi-arabia-and-nvidia-to-build-ai-factories-to-power-next-wave-of-intelligence-for-the-age-of-reasoning", "title": "Saudi Arabia and NVIDIA to Build AI Factories to Power Next Wave of Intelligence for the Age of Reasoning", "date": "2025-05-13 00:00:00", "content": "NVIDIA and the Kingdom of Saudi Arabia (KSA) today announced partnerships to transform the country into a global powerhouse in AI, cloud and enterprise computing, digital twins and robotics.\nDuring a state visit today with U.S. President Donald Trump and His Royal Highness Prince Mohammed bin Salman bin Abdulaziz Al Saud, Crown Prince and Prime Minister of Saudi Arabia, NVIDIA founder and CEO Jensen Huang said that the effort will harness sovereign AI infrastructure and expertise to propel Saudi Arabia to the ranks of global hyperscale AI leaders.\n“AI, like electricity and internet, is essential infrastructure for every nation,” Huang said. “Together with HUMAIN, we are building AI infrastructure for the people and companies of Saudi Arabia to realize the bold vision of the Kingdom.”\n“Our partnership with NVIDIA is a bold step forward in realizing the Kingdom’s ambitions to lead in AI and advanced digital infrastructure,” said Tareq Amin, CEO of HUMAIN. “Together, we are building the capacity, capability and a new globally enabled community to shape a future powered by intelligent technology and empowered people.”\nPowerful Partnerships\nNVIDIA and leading Saudi organizations will work together on several key initiatives:\nHUMAIN, a subsidiary of Saudi Arabia’s Public Investment Fund focused on AI, is making a major investment to build AI factories in KSA with a projected capacity of up to 500 megawatts powered by several hundred thousand of NVIDIA’s most advanced GPUs over the next five years. The first phase of deployment will be an 18,000 NVIDIA GB300 Grace Blackwell AI supercomputer with NVIDIA InfiniBand networking.\nHUMAIN will deploy the country’s first NVIDIA Omniverse Cloud to simulate and test physical AI solutions with digital twins.\nNVIDIA will strengthen the nation’s computing ecosystem and train thousands of developers with the skills to solve complex challenges with accelerated computing and AI.\nNVIDIA and the Saudi Data & AI Authority (SDAIA) will deploy up to 5,000 Blackwell GPUs for a sovereign AI factory and enable smart city solutions. NVIDIA and SDAIA will train government and university scientists and engineers on how to develop and deploy models for physical and agentic AI.\nAramco Digital will develop AI computing infrastructure, collaborate with NVIDIA’s startup ecosystem, establish AI enterprise platforms, and create an engineering and robotics center of excellence including NVIDIA platforms.\n“This partnership with NVIDIA reflects SDAIA’s commitment to harnessing and advancing the potential of data and AI through continuous innovation,” said H.E. Dr. Abdullah bin Sharaf Alghamdi, president of the SDAIA. “It marks a significant step toward positioning the Kingdom as a leader among data- and AI-driven economies, and in building a knowledge-based society and an advanced digital economy aligned with the objectives of Saudi Vision 2030.”\nThese initiatives will help industries such as energy, manufacturing and logistics to develop and deploy innovative solutions using the power of AI and digital twins to fuel growth and prosperity throughout the region, while boosting efficiency, safety and sustainability.\nThis effort will contribute to building a robust AI ecosystem and aligns with Saudi Arabia’s Vision 2030 goals of economic diversification and digital leadership."}
{"spider": "nvidia", "url": "https://nvidianews.nvidia.com/news/nvidia-and-storage-industry-leaders-unveil-new-class-of-enterprise-infrastructure-for-the-age-of-ai", "title": "NVIDIA and Storage Industry Leaders Unveil New Class of Enterprise Infrastructure for the Age of AI", "date": "2025-03-18 00:00:00", "content": "GTC—\nNVIDIA today announced the\nNVIDIA AI Data Platform\n, a customizable reference design that leading providers are using to build a new class of AI infrastructure for demanding AI inference workloads: enterprise storage platforms with AI query agents fueled by NVIDIA accelerated computing, networking and software.\nUsing the NVIDIA AI Data Platform,\nNVIDIA-Certified Storage\nproviders can build infrastructure to speed AI reasoning workloads with specialized AI query agents. These agents help businesses generate insights from data in near real time, using\nNVIDIA AI Enterprise\nsoftware — including\nNVIDIA NIM\n™ microservices for the new\nNVIDIA Llama Nemotron models\nwith reasoning capabilities — as well as the new\nNVIDIA AI-Q Blueprint\n.\nStorage providers can optimize their infrastructure to power these agents with\nNVIDIA Blackwell GPUs\n,\nNVIDIA BlueField\n®\nDPUs\n,\nNVIDIA Spectrum-X\n™\nnetworking\nand the\nNVIDIA Dynamo\nopen-source inference library.\nLeading data platform and storage providers — including\nDDN\n,\nDell Technologies\n,\nHewlett Packard Enterprise\n,\nHitachi Vantara\n,\nIBM\n,\nNetApp\n,\nNutanix\n,\nPure Storage\n,\nVAST Data\nand\nWEKA\n— are collaborating with NVIDIA to create customized AI data platforms that can harness enterprise data to reason and respond to complex queries.\n“Data is the raw material powering industries in the age of AI,” said Jensen Huang, founder and CEO of NVIDIA. “With the world’s storage leaders, we’re building a new class of enterprise infrastructure that companies need to deploy and scale agentic AI across hybrid data centers.”\nNVIDIA AI Data Platform Adds Accelerated Computing and AI to Storage\nThe NVIDIA AI Data Platform brings accelerated computing and AI to the millions of businesses using enterprise storage for the data that drives their company.\nNVIDIA Blackwell GPUs, BlueField DPUs and Spectrum-X networking provide an accelerated engine to speed AI query agent access to data stored on enterprise systems. BlueField DPUs deliver up to 1.6x higher performance than CPU-based storage while reducing power consumption by up to 50%, providing more than 3x higher performance per watt. Spectrum-X accelerates AI storage traffic up to 48% compared with traditional Ethernet by applying adaptive routing and congestion control.\nAI Data Platform storage infrastructure uses the\nNVIDIA AI-Q Blueprint\nfor developing agentic systems that can reason and connect to enterprise data. AI-Q taps into\nNVIDIA NeMo Retriever™ microservices\nto accelerate data extraction and retrieval by up to 15x on NVIDIA GPUs.\nAI query agents built with the\nAI-Q Blueprint\nconnect to data during inference to provide more accurate, context-aware responses. They can access large-scale data quickly and process various data types, including structured, semi-structured and unstructured data from multiple sources, including text, PDF, images and video.\nStorage Industry Leaders Building AI Data Platforms With NVIDIA\nNVIDIA-Certified Storage partners are collaborating with NVIDIA to build custom AI data platforms.\nDDN\nis architecting AI Data Platform capabilities into its DDN Infinia AI platform.\nDell\nis creating AI data platforms for its family of Dell PowerScale and Project Lightning solutions.\nHewlett Packard Enterprise\nis infusing AI Data Platform capabilities into HPE Private Cloud for AI, HPE Data Fabric, HPE Alletra Storage MP and HPE GreenLake for File Storage.\nHitachi Vantara\nis bringing AI Data Platform into the Hitachi IQ ecosystem, helping customers innovate with storage systems and data offerings that drive tangible AI outcomes.\nIBM\nis integrating AI Data Platform as part of its content-aware storage capability with IBM Fusion and IBM Storage Scale technology to accelerate retrieval-augmented generation applications.\nNetApp\nis advancing enterprise storage for agentic AI with the NetApp AIPod solution built with AI Data Platform.\nNutanix\nCloud Platform with Nutanix Unified Storage will integrate with the NVIDIA AI Data Platform and enable inferencing and agentic workflows deployed across edge, data center and public cloud.\nPure Storage\nwill deliver AI Data Platform capabilities with Pure Storage FlashBlade.\nVAST Data\nis working with AI Data Platform to curate real-time insights with VAST InsightEngine.\nWEKA\nData Platform software integrates with NVIDIA GPUs, DPUs and networking to optimize data access for agentic AI reasoning and insights and deliver a high-performance storage foundation that accelerates AI inference and token processing workloads.\nNVIDIA-Certified Storage providers are planning to offer solutions created with the NVIDIA AI Data platform starting this month.\nLearn more by watching the\nNVIDIA GTC keynote\nand\nregister for sessions\nfrom NVIDIA and industry leaders at the show, which runs through March 21"}
{"spider": "nvidia", "url": "https://nvidianews.nvidia.com/news/nvidia-earth-2-climate-tech-weather-prediction-disaster-preparedness", "title": "Climate Tech Companies Adopt NVIDIA Earth-2 for High-Resolution, Energy-Efficient, More Accurate Weather Predictions and Disaster Preparedness", "date": "2025-03-18 00:00:00", "content": "GTC—\nNVIDIA today announced the\nNVIDIA Omniverse Blueprint for Earth-2 weather analytics\nto accelerate the development of more accurate weather forecasting solutions.\nClimate-related weather events have had a $2 trillion\nimpact\non the global economy over the last decade. The new Omniverse Blueprint equips users with the latest technologies to help global organizations improve risk management and disaster preparedness.\nThe NVIDIA Omniverse Blueprint for Earth-2 weather analytics offers reference workflows — including NVIDIA GPU acceleration libraries, a physics-AI framework, development tools and microservices — to help enterprises go from prototyping to production with weather forecast models.\nEasy-to-deploy NVIDIA NIM™ microservices for NVIDIA Earth-2 are also part of the blueprint, including CorrDiff for downscaling and FourCastNet for predicting global atmospheric dynamics of various weather and climate variables. These are already being used by weather technology companies, researchers and government agencies to derive insights and mitigate risk from extreme weather events.\n“We’re seeing more extreme weather events and natural disasters than ever, threatening lives and property,” said Jensen Huang, founder and CEO of NVIDIA. “The NVIDIA Omniverse Blueprint for Earth-2 will help industries around the world prepare for — and mitigate — climate change and weather-related disasters.”\nEcosystem Support\nIndustry-leading climate tech companies including AI company G42, JBA Risk Management, Spire and others are using the blueprint to develop unique AI-augmented solutions.\nWhen combined with proprietary enterprise data in the $20 billion climate tech industry, the NVIDIA Earth-2 platform helps developers build solutions that deliver warnings and updated forecasts in seconds rather than minutes or hours with traditional CPU-driven modeling.\nG42 is integrating various components of the Omniverse Blueprint with its own AI-driven forecasting models for Earth-2 to provide the UAE’s National Center of Meteorology with AI technologies for advanced weather forecasting and disaster management.\n“G42 is advancing AI-powered forecasting to help governments and enterprises strengthen resilience against extreme weather in a rapidly changing world,” said Andrew Jackson, CEO of Inception, a G42 company. “Using high-resolution weather and climate modeling, we are transforming how organizations anticipate and respond to severe weather conditions with precision and speed. Building on NVIDIA’s CorrDiff model, we have developed a custom AI-driven system that downscales coarse weather data into hyper-local forecasts, enabling faster predictions at an unprecedented scale. Combined with the Earth-2 Blueprint, this technology equips decision-makers with actionable intelligence to protect communities, safeguard infrastructure and plan for a more resilient future.”\nSpire Global used AI components from the blueprint as reference to develop new AI products that integrate its proprietary satellite data and deliver medium-range and sub-seasonal forecasts out to 45 days. Powered by NVIDIA GPUs and the Omniverse Blueprint for Earth-2, Spire’s models run 1,000x faster than traditional physics-based models, enabling large ensemble forecasts that capture the full range of possible weather outcomes.\nIn addition to the Central Weather Administration of Taiwan and The Weather Company, other companies adopting or exploring Earth-2 include 3D mapping company Ecopia, spatial analytics company ESRI, green energy company GCL Power, flood risk management company JBA Risk Management, aerospace company OroraTech, and Tomorrow.io, a leading resilience platform powered by proprietary space data and weather intelligence.\nGroundbreaking Generative AI for Climate Tech\nThe Earth-2 platform offers tools, microservices and an array of state-of-the-art AI weather models for visualizing and simulating the globe.\nCorrDiff\n, part of the Omniverse Blueprint, is available as an\nNVIDIA NIM microservice\n. Compared with CPUs, it can be 500x faster and 10,000x more energy-efficient in delivering high-resolution numerical weather predictions.\nThe Omniverse Blueprint for Earth-2 allows independent software vendors to develop and deploy AI-augmented solutions and use observational data to make their solutions faster and more accurate.\nEsri, a leader in geospatial technology, is collaborating with NVIDIA to connect its ArcGIS platform to Earth-2 through the blueprint. OroraTech is exploring connecting its data platform to the Omniverse Blueprint for Earth-2.\nTomorrow.io contributed its near-real-time proprietary satellite data to help create an NVIDIA digital twin of Earth for next-generation AI model training, inference and reinforcement.\nA key component of the new blueprint is\nNVIDIA Omniverse\n™, a platform for developing OpenUSD-based 3D workflows and applications. The Omniverse Blueprint for Earth-2 showcases how developers can use Omniverse software development kits and microservices to build NVIDIA RTX™-powered visualization pipelines for rendering geospatial and weather data.\nNVIDIA DGX Cloud-Powered Compute\nThe Omniverse Blueprint for Earth-2 taps into the\nNVIDIA DGX™ Cloud\nplatform to demonstrate full-stack acceleration for AI-augmented weather forecasting. Running on NVIDIA DGX GB200, NVIDIA HGX™ B200 and NVIDIA OVX™ supercomputers, the blueprint provides a path to simulating and visualizing the global climate simulations at exceptional speed and scale.\nLearn more by watching the\nNVIDIA GTC keynote\nand\nregister for sessions\nfrom NVIDIA and industry leaders at the show, which runs through March 21."}
{"spider": "nvidia", "url": "https://nvidianews.nvidia.com/news/nvidia-alphabet-and-google-collaborate-on-the-future-of-agentic-and-physical-ai", "title": "NVIDIA, Alphabet and Google Collaborate on the Future of Agentic and Physical AI", "date": "2025-03-18 00:00:00", "content": "GTC—\nBuilding on their longstanding partnership, NVIDIA, Alphabet and Google today announced new initiatives to advance AI, democratize access to AI tools, speed the development of physical AI and transform industries including healthcare, manufacturing and energy.\nEngineers and researchers throughout Alphabet are working closely with technical teams at NVIDIA to use AI and simulation to develop robots with grasping skills, reimagine drug discovery, optimize energy grids and more. Employing the\nNVIDIA Omniverse™\n,\nNVIDIA Cosmos™\nand\nNVIDIA Isaac™\nplatforms, teams from Google DeepMind, Isomorphic Labs, Intrinsic and X’s moonshot Tapestry will discuss milestones from their respective collaborations at the NVIDIA GTC global AI conference.\nTo power research and AI production efforts for its customers, Alphabet’s Google Cloud will be among the first to adopt the NVIDIA GB300 NVL72 rack-scale solution and NVIDIA RTX PRO™ 6000 Blackwell Server Edition GPU, also announced today at GTC.\nNVIDIA will be the first industry partner to adopt\nSynthID\n, a Google DeepMind AI technology that embeds digital watermarks directly into AI-generated images, audio, text or video.\n“I’m proud of our ongoing and deep partnership with NVIDIA, which spans the early days of Android and our cutting-edge AI collaborations across Alphabet,” said Sundar Pichai, CEO of Google and Alphabet. “I’m really excited about the next phase of our partnership as we work together on agentic AI, robotics and bringing the benefits of AI to more people around the world.”\n“Alphabet and NVIDIA have a longstanding partnership that extends from building AI infrastructure and software to advancing the use of AI in the largest industries,” said Jensen Huang, founder and CEO of NVIDIA. “It’s a great joy to see Google and NVIDIA researchers and engineers collaborate to solve incredible challenges, from drug discovery to robotics.”\nDeveloping Responsible AI and Open Models\nGoogle DeepMind and NVIDIA are working to build trust in generative AI through content transparency.\nNVIDIA will be the first external user of Google DeepMind’s\nSynthID\n, which embeds digital watermarks directly into AI-generated images, audio, text and video. SynthID helps preserve the integrity of outputs from NVIDIA Cosmos world foundation models, available on\nbuild.nvidia.com\n, helping to safeguard against misinformation and misattribution — all without compromising video quality.\nGoogle DeepMind and NVIDIA also partnered to optimize Gemma, Google’s family of lightweight, open models, to run on NVIDIA GPUs. The recent launch of\nGemma 3\nmarks a significant leap forward for open innovation.\nNVIDIA has played a key role in making Gemma even more accessible for developers. Supercharged by the NVIDIA AI platform, Gemma is available as a highly optimized NVIDIA NIM™ microservice, harnessing the power of the open-source NVIDIA TensorRT-LLM library for exceptional inference performance.\nIn addition, this deep engineering collaboration will extend to optimizing Gemini-based workloads on NVIDIA accelerated computing via Vertex AI.\nThe Age of Intelligent Robots\nIntrinsic\nis an Alphabet company focused on making intelligently adaptive AI for robotics usable and valuable for manufacturers across industries. Today, the majority of the world’s installed industrial robots are manually programmed, with every movement hard-coded in a complex, expensive process.\nPartnering with NVIDIA, the teams have built deeper and more intuitive developer workflows for Intrinsic Flowstate to support NVIDIA Isaac Manipulator foundation models for a universal robot grasping capability. Using foundation models for robotics will significantly reduce application development time and improve flexibility, with AI that can adapt effortlessly. At GTC, Intrinsic will also share an early OpenUSD framework streaming connection between Intrinsic Flowstate and NVIDIA Omniverse — enabling real-time visualization of robot workcells across platforms.\nConcurrently, NVIDIA and Google DeepMind are announcing a collaboration with Disney Research to develop\nNewton\n, an open-source physics engine accelerated by the\nNVIDIA Warp\nframework that is compatible with MuJoCo. Powered by Newton, MuJoCo will accelerate robotics machine learning workloads by more than 70x compared with MuJoCo’s existing GPU-accelerated simulator, MJX.\nApplying Innovation to Real-World Challenges\nIsomorphic Labs\n, founded by Google DeepMind CEO Demis Hassabis, is reimagining drug discovery with AI. It has built a state-of-the-art drug design engine housed on Google Cloud with NVIDIA GPUs to enable the scale and performance needed to continue developing groundbreaking AI models that can help advance human health.\nTapestry\n, X’s moonshot for the electric grid, is building AI-powered products for a greener and more reliable future grid. Tapestry and NVIDIA are exploring methods for increasing the speed and accuracy of electric grid simulations.\nThis joint effort will focus on the challenges of integrating new energy sources and expanding grid capacity to meet the growing demands of data centers and AI, while helping ensure grid stability. The companies will evaluate potential solutions, including using AI to optimize the interconnection process, with the goal of enhancing the planning and modernization of energy infrastructure for a more sustainable future.\nThe Next Generation of AI-Optimized Infrastructure\nBuilding on its commitment to provide customers with the most advanced AI infrastructure, Google Cloud will be one of the first companies to offer the latest instances of NVIDIA Blackwell GPUs — NVIDIA GB300 NVL72 and NVIDIA RTX PRO 6000 Blackwell Server Edition.\nBuilt on the groundbreaking Blackwell architecture introduced a year ago, Blackwell Ultra includes the NVIDIA GB300 NVL72 rack-scale solution and the NVIDIA HGX™ B300 NVL16 system. The GB300 NVL72 delivers 1.5x more AI performance than the NVIDIA GB200 NVL72, as well as increases Blackwell’s revenue opportunity by 50x for AI factories, compared with those built with NVIDIA Hopper™. NVIDIA RTX PRO 6000 Blackwell is the ultimate universal GPU for both AI and visual computing workloads across healthcare, manufacturing, retail, live broadcast and other industries.\nWith last month’s preview launches of its\nA4\nand\nA4X\nvirtual machines, Google Cloud became the first cloud provider to offer both NVIDIA B200- and GB200-based instances. Now, A4 is generally available — with A4X coming soon — so customers can take advantage of Blackwell’s powerful performance with the added benefits of Google Cloud’s\nAI Hypercomputer\n.\nGoogle Cloud and NVIDIA\nhave worked together to optimize popular open-source frameworks like JAX, a popular Python library for machine learning, and MaxText to run efficiently on NVIDIA GPUs at scale. MaxText, an advanced framework for scaling large models across massive GPU clusters, uses optimizations codeveloped with NVIDIA to enable efficient training on tens of thousands of GPUs.\nGTC attendees interested in learning more about Alphabet and NVIDIA’s work can visit the Google Cloud booth 914."}
{"spider": "nvidia", "url": "https://nvidianews.nvidia.com/news/nvidia-and-ge-healthcare-collaborate-to-advance-the-development-of-autonomous-diagnostic-imaging-with-physical-ai", "title": "NVIDIA and GE HealthCare Collaborate to Advance the Development of Autonomous Diagnostic Imaging With Physical AI", "date": "2025-03-18 00:00:00", "content": "GTC—\nNVIDIA today announced a collaboration with GE HealthCare to advance innovation in autonomous imaging, focused on developing autonomous X-ray technologies and ultrasound applications.\nBuilding autonomy into systems like X-ray and ultrasound requires medical imaging systems to understand and operate in the physical world. This enables the automation of complex workflows such as patient placement, image scanning and quality checking.\nTo accomplish this, GE HealthCare, a pioneering partner, is using the new NVIDIA Isaac™ for Healthcare medical device simulation platform, which includes pretrained models and physics-based simulations of sensors, anatomy and environments. The platform accelerates research and development workflows, enabling GE HealthCare to train, test and validate autonomous imaging system capabilities in a virtual environment before deployment in the physical world.\n“The healthcare industry is one of the most important applications of AI, as the demand for healthcare services far exceeds the supply,” said Kimberly Powell, vice president of healthcare at NVIDIA. “We are working with an industry leader, GE HealthCare, to deliver Isaac for Healthcare, three computers to give lifesaving medical devices the ability to act autonomously and extend access to healthcare globally.”\nExpanding Access to Imaging With Physical AI\nUltrasounds and X-ray are the most common and widely used diagnostic imaging systems, yet nearly two-thirds of the global population lack access. Enhancing imaging systems with robotic capabilities will help expand access to care.\nNVIDIA and GE HealthCare have been working together for nearly two decades, building innovative image-reconstruction techniques across CT and MRI, image-guided therapy and mammography.\n“GE HealthCare is committed to developing innovative technologies that redefine and enhance patient care,” said Roland Rott, president and CEO of Imaging at GE HealthCare. “We look forward to taking advantage of physical AI for autonomous imaging systems with NVIDIA technology to improve patient access and address the challenges of growing workloads and staffing shortages in healthcare.”\nIsaac for Healthcare Closes Gap Between Simulation and Reality\nNVIDIA will also support other customers with Isaac for Healthcare for use cases including simulation environments. Simulation environments enable robotic systems to safely learn skills in a physically accurate virtual environment for real-world situations, such as surgery, that would otherwise be impossible to replicate.\nIsaac for Healthcare is a physical AI platform built on NVIDIA’s three computers for robotics:\nNVIDIA DGX\n™,\nNVIDIA Omniverse\n™ and\nNVIDIA Holoscan\n. It includes AI models fine-tuned for healthcare robotics that can understand, act and see using enhanced vision and language processing. It also has a simulation framework for developers to accurately simulate medical environments and provides seamless deployment on NVIDIA Holoscan, an edge AI computing platform, to power robotic decision-making in the real world, in real time.\nSimulation options for medical sensors are often limited. With Isaac for Healthcare, developers can now access physics-based\ndigital twins\nof medical environments, allowing them to import custom sensors, instruments and even anatomies to teach robots how to respond to various scenarios. These virtual environments help close the gap between simulation and real-world implementation, and enable rapid digital prototyping.\nIsaac for Healthcare allows for multi-scale simulation ranging from microscopic structures and surgery suites to full hospital facilities. Easy policy training in simulation allows robotic systems to learn how to respond in various medical scenarios in the operating room, and how to best support physician decision-making and patient care.\nHealthcare Robotics Ecosystem Rapidly Expands\nIsaac for Healthcare can help speed the development of robotic healthcare solutions by simulating complex medical scenarios, training AI models and optimizing robotic applications like surgery, endoscopy and cardiovascular interventions. Early adopters include Moon Surgical, Neptune Medical and Xcath.\nIsaac for Healthcare is enabling ecosystem partners to seamlessly integrate their simulation tools, sensors, robot systems and medical probes into a domain-specific simulation environment. Among early ecosystem partners are Ansys, Franka, ImFusion, Kinova and Kuka.\nIssac for Healthcare is now available in early access."}
{"spider": "nvidia", "url": "https://nvidianews.nvidia.com/news/nvidia-to-build-accelerated-quantum-computing-research-center", "title": "NVIDIA to Build Accelerated Quantum Computing Research Center", "date": "2025-03-18 00:00:00", "content": "GTC—\nNVIDIA today announced it is building a Boston-based research center to provide cutting-edge technologies to advance quantum computing.\nThe NVIDIA Accelerated Quantum Research Center, or\nNVAQC\n, will integrate leading quantum hardware with AI supercomputers, enabling what is known as accelerated quantum supercomputing. The NVAQC will help solve quantum computing’s most challenging problems, ranging from qubit noise to transforming experimental quantum processors into practical devices.\nLeading quantum computing innovators, including\nQuantinuum\n, Quantum Machines and\nQuEra Computing\n, will tap into the NVAQC to drive advancements through collaborations with researchers from leading universities, such as the Harvard Quantum Initiative in Science and Engineering (HQI) and the Engineering Quantum Systems (EQuS) group at the Massachusetts Institute of Technology (MIT).\n“Quantum computing will augment AI supercomputers to tackle some of the world’s most important problems, from drug discovery to materials development,” said Jensen Huang, founder and CEO of NVIDIA. “Working with the wider quantum research community to advance CUDA-quantum hybrid computing, the NVIDIA Accelerated Quantum Research Center is where breakthroughs will be made to create large-scale, useful, accelerated quantum supercomputers.”\nPropelling Quantum Innovation\nThrough the NVAQC, commercial and academic partners will work with NVIDIA to use state-of-the-art NVIDIA GB200 NVL72 rack-scale systems, the most powerful hardware ever deployed for quantum computing applications. This enables complex simulations of quantum systems and the deployment of the low-latency quantum hardware control algorithms essential for quantum error correction. NVIDIA GB200 NVL72 systems will also accelerate the adoption of AI algorithms in quantum computing research.\nTo address the challenges of integrating GPU and QPU hardware, the NVAQC will employ the\nNVIDIA CUDA-Q™\nquantum development platform, enabling researchers to develop new hybrid quantum algorithms and applications.\nThe HQI — a community of researchers dedicated to advancing the science and engineering of quantum systems and their applications — will collaborate with the NVAQC to advance their research on next-generation quantum computing technologies.\n“The NVAQC is a very special addition to the unique Boston area quantum ecosystem, including world-leading university groups and startup companies,” said Mikhail Lukin, Joshua and Beth Friedman University Professor at Harvard and a co-director of HQI. “The accelerated quantum and classical computing technologies NVIDIA is bringing together has the potential to advance the research in areas ranging from quantum error correction to applications of quantum computing systems, accelerating quantum computing research and pulling useful quantum computing closer to reality.”\nResearchers from the EQuS group, a member of the MIT Center for Quantum Engineering — which serves as a hub for research, education and engagement in support of quantum engineering — will use NVAQC to develop techniques like quantum error correction.\n“The NVIDIA Accelerated Quantum Research Center will provide EQuS group researchers with unprecedented access to the technologies and expertise needed to solve the challenges of useful quantum computing,” said William Oliver, professor of electrical engineering and computer science, and of physics, leader of the EQuS group and director of the MIT Center for Quantum Engineering. “We anticipate the future will also include other members of the Center for Quantum Engineering at MIT. Integrating the NVIDIA accelerated computing platform with qubits will help tackle core challenges like quantum error correction, hybrid application development and quantum device characterization.”\nThe NVAQC is expected to begin operations later this year.\nLearn more about NVIDIA’s quantum computing initiatives and hear from industry leaders by joining\nQuantum Day\nat NVIDIA GTC, which runs through March 21."}
{"spider": "nvidia", "url": "https://nvidianews.nvidia.com/news/oracle-and-nvidia-collaborate-to-help-enterprises-accelerate-agentic-ai-inference", "title": "Oracle and NVIDIA Collaborate to Help Enterprises Accelerate Agentic AI Inference", "date": "2025-03-18 00:00:00", "content": "GTC—\nOracle and NVIDIA today announced a first-of-its-kind integration between NVIDIA accelerated computing and inference software with Oracle’s\nAI infrastructure\n, and\ngenerative AI services\n, to help organizations globally speed creation of agentic AI applications.\nThe new integration between Oracle Cloud Infrastructure (OCI) and the\nNVIDIA AI Enterprise\nsoftware platform will make 160+ AI tools and 100+ NVIDIA NIM™ microservices natively available through the OCI Console. In addition, Oracle and NVIDIA are collaborating on the no-code deployment of both Oracle and\nNVIDIA AI Blueprints\nand on accelerating AI vector search in Oracle Database 23ai with the\nNVIDIA cuVS library\n.\n“Oracle has become the platform of choice for both AI training and inferencing, and this partnership enhances our ability to help customers achieve greater innovation and business results,” said Safra Catz, CEO of Oracle. “NVIDIA’s offerings, paired with OCI’s flexibility, scalability, performance and security, will speed AI adoption and help customers get more value from their data.”\n“Oracle and NVIDIA are perfect partners for the age of reasoning — an AI and accelerated computing company working with a key player in processing much of the world’s enterprise data,” said Jensen Huang, founder and CEO of NVIDIA. “Together, we help enterprises innovate with agentic AI to deliver amazing things for their customers and partners.”\nPurpose-Built Solutions to Meet Enterprise AI Needs\nReducing the time it takes to deploy reasoning models, NVIDIA AI Enterprise will be natively available through the OCI Console, enabling customers to quickly and easily access AI tools including NVIDIA NIM — a set of 100+ optimized, cloud-native inference microservices for leading AI models, including the latest NVIDIA Llama Nemotron models for advanced AI reasoning.\nNVIDIA AI Enterprise will be available as a deployment image for OCI bare-metal instances and Kubernetes clusters using OCI Kubernetes Engine. OCI Console customers benefit from direct billing and customer support through Oracle.\nOrganizations can deploy OCI’s 150+ AI and cloud services with NVIDIA accelerated computing and NVIDIA AI Enterprise in the data center, the public cloud or at the edge. This offering provides an integrated AI stack to help address data privacy, sovereign AI and low-latency requirements.\nBiotechnology company Soley Therapeutics is deploying OCI AI Infrastructure, NVIDIA AI Enterprise and NVIDIA Blackwell GPUs to build its AI drug discovery platform to unlock possible treatments for complex diseases by capturing, decoding and interpreting cellular language to forecast cell fate.\n“We believe in the potential of AI in developing new solutions that can help deliver treatments for cancer and other complex diseases,” said Yerem Yeghiazarians, cofounder and CEO of Soley Therapeutics. “The combination of OCI and NVIDIA delivers a full-stack AI solution, providing us the storage, compute, software tools and support necessary to innovate faster with petabytes of data in developing our AI drug discovery platform.”\nAI Deployment at Scale With Tailored Blueprints\nOCI AI Blueprints\nprovide no-code deployment recipes that enable customers to quickly run AI workloads without having to make decisions about the software stack or manually provision the infrastructure. The blueprints offer clear hardware recommendations for NVIDIA GPUs, NIM microservices and prepackaged observability tools, helping enterprises accelerate their AI projects from weeks to minutes.\nIn addition,\nNVIDIA Blueprints\nprovide developers with a unified experience across the NVIDIA stack, providing reference workflows for enterprise AI use cases. Using NVIDIA Blueprints, organizations can build and operationalize custom AI applications with NVIDIA AI Enterprise and\nNVIDIA Omniverse\n™ software, application programming interfaces and microservices. For example, developers can begin with an NVIDIA AI Blueprint for a customer service AI assistant and customize it for their own use.\nTo simplify the development, deployment and scale-out of advanced physical AI and simulation applications and workflows, the NVIDIA Omniverse platform and NVIDIA Isaac Sim™ development workstations and Omniverse Kit App Streaming are expected to be available on Oracle Cloud Infrastructure Marketplace later this year, preconfigured with compute bare-metal instances accelerated by NVIDIA L40S GPUs.\nPipefy, an AI-powered automation platform for business process management, uses an inference blueprint for document preprocessing and image processing.\n“We embraced OCI AI Blueprints to spin up NVIDIA GPU nodes and deploy multimodal large language models quickly for document- and image-processing use cases,” said Gabriel Custodio, principal software engineer at Pipefy. “Using these prepackaged and verified blueprints, deploying our AI models on OCI is now fully automated and significantly faster.”\nReal-Time AI Inference With NVIDIA NIM in OCI Data Science\nTo further accelerate enterprise AI adoption and help enable quick AI deployments with minimal setup, data scientists can access pre-optimized NVIDIA NIM microservices directly in OCI Data Science. This supports real-time AI inference use cases without the complexity of managing infrastructure.\nTo help maintain data security and compliance, the models run in the customer’s OCI tenancy. Customers can purchase the models through a flexible, pay-as-you-go, hourly pricing model or apply their Oracle Universal Credits.\nOrganizations can use this integration to deploy inference endpoints with preconfigured, optimized NIM inference engines in minutes, rapidly accelerating time to value for use cases such as AI-powered assistants, real-time recommendation engines and copilots. In addition, this allows customers to start using the integration for smaller workloads and seamlessly scale to enterprise-wide deployments.\nNVIDIA Accelerated Computing Platform Turbocharges AI Vector Search in Oracle Database 23ai\nOracle and NVIDIA are working together to accelerate the creation of vector embeddings and vector indexes — compute-intensive portions of AI Vector Search workloads in Oracle Database 23ai — using NVIDIA GPUs and NVIDIA cuVS.\nOrganizations can enable vector embedding through bulk vectorization of large volumes of input data such as text, images and videos, as well as the fast creation and maintenance of vector indexes. With NVIDIA-accelerated AI Vector Search, Oracle Database customers can significantly improve the performance of their AI pipelines to help support high-volume AI vector workloads.\nDeweyVision provides advanced computer vision and artificial intelligence capabilities to turn media into data, making it accessible, searchable, discoverable, retrievable and actionable. DeweyVision uses Oracle Database 23ai on Oracle Autonomous Database for its AI-powered, no-code warehousing tools. These tools enable production professionals to connect their workflows and edit video footage quickly by cataloging footage in minutes and providing intuitive search capabilities.\n“Oracle Database 23ai with AI Vector Search can significantly increase Dewey’s search performance while increasing the scalability of the DeweyVision platform,” said Majid Bemanian, CEO of DeweyVision. “Using NVIDIA GPUs to create the vector embeddings that we load into Oracle Database accelerates our platform’s ingestion of new data, while Autonomous Database and the converged capabilities of Oracle Database 23ai will help reduce our operational costs as we grow and open new opportunities. We believe that the combination of DeweyVision, Oracle Database 23ai and NVIDIA GPUs running in OCI will help us achieve our goal of becoming Hollywood’s data warehouse.”\nNVIDIA Blackwell on OCI Enables AI Anywhere\nOracle and NVIDIA continue to evolve AI infrastructure with new NVIDIA GPU types across OCI’s public regions, government clouds, sovereign clouds, OCI Dedicated Region, Oracle Alloy, OCI Compute Cloud@Customer and OCI Roving Edge Devices.\nThis includes\nNVIDIA Quantum-2 InfiniBand\ncluster network environments,\nNVIDIA Spectrum\n™ Ethernet switches and optimized NVIDIA NVLink™ and NVLink Switch functionality for some of the largest AI superclusters in the market.\nOCI will offer NVIDIA GB200 NVL72 systems on\nOCI Supercluster\n— generally available soon with up to 131,072 NVIDIA GPUs — and is taking orders for one of the largest AI supercomputers in the cloud with NVIDIA Blackwell Ultra GPUs.\nOCI will be among the first cloud service providers to offer the next generation of the NVIDIA Blackwell accelerated computing platform. Built on the groundbreaking Blackwell architecture introduced a year ago, Blackwell Ultra includes the NVIDIA GB300 NVL72 rack-scale solution and the NVIDIA HGX™ B300 NVL16 system. The GB300 NVL72 delivers 1.5x more AI performance than the NVIDIA GB200 NVL72, as well as increases Blackwell’s revenue opportunity by 50x for AI factories, compared with those built with NVIDIA Hopper™.\nSoundHound, a global leader in conversational intelligence, offers voice and conversational AI solutions, powering voice-related experiences in millions of products from global brands. Its voice AI platform runs on OCI, processing billions of queries annually, and uses NVIDIA GPUs to provide customers with fast and accurate voice services.\n“SoundHound has developed a long-term relationship with OCI, and we believe our ongoing collaboration will play a key role in supporting future growth,” said James Hom, chief product officer of SoundHound AI. “NVIDIA GPUs will greatly accelerate training for our next generation of voice AI.”\nAdditional Resources\nLearn more about\nOCI AI infrastructure\n.\nLearn more about\nOracle Cloud Infrastructure\n.\nLearn more about\nOracle expanding its distributed cloud capabilities with NVIDIA AI Enterprise\n.\nLearn more about\nOCI AI infrastructure for OCI Dedicated Region and Oracle Alloy\n.\nRead the OCI Supercluster\ntechnical blog\nand watch the\nvideo\n.\nAbout Oracle Distributed Cloud\nOracle’s distributed cloud delivers the benefits of cloud with greater control and flexibility. Oracle’s distributed cloud lineup includes:\nPublic cloud\n: Hyperscale public cloud regions serve any size of organization, including those requiring strict EU sovereignty controls. See the\nfull list of regions\n.\nDedicated cloud\n: Customers can run all OCI cloud services in their own data centers with OCI Dedicated Region, while partners can resell OCI cloud services and customize the experience using Oracle Alloy. Oracle also operates separate U.S., U.K. and Australian government clouds, as well as isolated cloud regions for national security purposes. Each of these products provides a full cloud and AI stack that customers can deploy as a sovereign cloud.\nHybrid cloud\n: OCI delivers key cloud services on-premises via Oracle Exadata Cloud@Customer and Compute Cloud@Customer and is already managing deployments in over 60 countries. Additionally, OCI Roving Edge Infrastructure, which consists of multiple configurations of ruggedized and portable high-performance devices, helps customers leverage remote AI inferencing at the edge.\nMulticloud\n: OCI is physically deployed within all the hyperscale cloud providers, including AWS, Google Cloud and Microsoft Azure, providing low-latency, natively integrated Oracle database services, including Oracle Database@AWS, Oracle Database@Azure, Oracle Database@Google Cloud and Oracle HeatWave on AWS. Oracle Interconnect for Microsoft Azure and Oracle Interconnect for Google Cloud allows customers to combine key capabilities from across clouds."}
{"spider": "nvidia", "url": "https://nvidianews.nvidia.com/news/nvidia-blackwell-geforce-rtx-arrives-for-every-gamer-starting-at-299", "title": "NVIDIA Blackwell GeForce RTX Arrives for Every Gamer, Starting at $299", "date": "2025-04-15 00:00:00", "content": "NVIDIA today announced the NVIDIA GeForce RTX™ 5060 family of GPUs, including two graphics cards that deliver neural rendering and NVIDIA Blackwell architecture innovations for every gamer — starting at just $299.\nThe GeForce RTX 5060 Ti and RTX 5060 graphics cards feature\nNVIDIA DLSS 4\n, full ray tracing, neural rendering and\nNVIDIA Reflex\ntechnologies for exceptional performance and image quality.\n“The RTX 5060 family offers gamers next-generation performance and AI-enhanced visuals starting at $299,” said Matt Wuebbling, vice president of GeForce marketing at NVIDIA. “Powered by the advanced NVIDIA Blackwell architecture and featuring DLSS 4 technology in over 100 games, this new class of GPUs elevates gaming with stunning visuals, high frame rates and quick responsiveness.”\nDLSS 4 Now in 100+ Games\nThe GeForce RTX 5060 family includes DLSS 4 capabilities such as Multi Frame Generation and Super Resolution, as well as NVIDIA Reflex to reduce latency. More than 100 games now feature these AI-powered enhancements. Blockbuster titles like\nAlan Wake 2\n,\nBlack Myth: Wukong, Cyberpunk 2077\nand\nHogwarts Legacy\nboast stunning ray-traced visuals at over 100 frames per second (fps) on maximum settings.\nBoosting Creative Workflows\nThe RTX 5060 family can also serve as a powerful companion for creators. Equipped with Blackwell FP4 Tensor Cores and ninth-generation\nNVIDIA NVENC\nencoders, the GPUs can enhance creative workflows for livestreamers, video editors, 3D artists and others.\nIntroducing GeForce RTX 5060 Laptops\nIn addition, the GeForce RTX 5060 Laptop GPU has arrived, bringing enhanced gaming and creative capabilities to laptops. Built with the Blackwell architecture and DLSS 4, the GPU ensures every gamer and creator can enjoy 144 fps and 8K 4:2:2 color format video editing. GeForce RTX 5060 laptops can deliver double the frame rates and lower latency compared with previous-generation models — and are coming in a broad range of designs and sizes as thin as 14.9 millimeters.\nAvailability\nGeForce RTX 5060 Ti graphics cards, equipped with 16GB or 8GB graphics memory, will be available starting April 16 at $429 and $379, respectively.\nGeForce RTX 5060 graphics cards will be available starting in May at $299.\nStock-clocked and factory-overclocked models will be available from top add-in card providers such as ASUS, Colorful, Gainward, GALAX, GIGABYTE, INNO3D, KFA2, MSI, Palit, PNY and ZOTAC, and in desktops from system builders including Falcon Northwest, Infiniarc, MAINGEAR, Mifcom, ORIGIN PC, PC Specialist and Scan Computers.\nLaptops equipped with GeForce RTX 5060 laptop GPUs will be available from every major manufacturer beginning in May, starting at $1,099.\nFind full specifications and additional details on the\nNVIDIA GeForce webpage\n."}
{"spider": "nvidia", "url": "https://nvidianews.nvidia.com/news/nvidia-sets-conference-call-for-first-quarter-financial-results-6910262", "title": "NVIDIA Sets Conference Call for First-Quarter Financial Results", "date": "2025-04-30 00:00:00", "content": "SANTA CLARA, Calif., April 30, 2025 -- NVIDIA will host a conference call on Wednesday, May 28, at 2 p.m. PT (5 p.m. ET) to discuss its financial results for the first quarter of fiscal year 2026, which ended April 27, 2025.\nThe call will be webcast live (in listen-only mode) on\ninvestor.nvidia.com\n. The company’s prepared remarks will be followed by a Q&A session, which will be limited to questions from financial analysts and institutional investors.\nAhead of the call, NVIDIA will provide written commentary on its first-quarter results from Colette Kress, the company's executive vice president and chief financial officer. This material will be posted to\ninvestor.nvidia.com\nimmediately after the company’s results are publicly announced at approximately 1:20 p.m. PT.\nThe webcast will be recorded and available for replay until the company’s conference call to discuss financial results for its second quarter of fiscal year 2026."}
{"spider": "nvidia", "url": "https://nvidianews.nvidia.com/news/humain-and-nvidia-announce-strategic-partnership-to-build-ai-factories-of-the-future-in-saudi-arabia", "title": "HUMAIN and NVIDIA Announce Strategic Partnership to Build AI Factories of the Future in Saudi Arabia", "date": "2025-05-13 00:00:00", "content": "HUMAIN, the new full AI value chain subsidiary of Saudi Arabia’s Public Investment Fund, today announced a landmark strategic partnership with NVIDIA, the world leader in AI computing infrastructure, to drive the next wave of artificial intelligence development.\nThe two organizations will leverage NVIDIA platforms and expertise to establish Saudi Arabia as a global leader in AI, GPU cloud computing and digital transformation to drive innovation and growth worldwide.\nThe partnership underscores HUMAIN’s mission to position Saudi Arabia as an international AI powerhouse — combining cutting-edge infrastructure, frontier AI models, immersive digital platforms and human capital development.\nPowering AI Factories of Tomorrow\nHUMAIN is making a major investment to build AI factories in the Kingdom of Saudi Arabia with a projected capacity of up to 500 megawatts powered by several hundred thousand of NVIDIA’s most advanced GPUs over the next five years. The first phase of deployment will be an 18,000 NVIDIA GB300 Grace Blackwell AI supercomputer with NVIDIA InfiniBand networking.\nThese hyperscale AI data centers will provide a secure foundational infrastructure for training and deploying sovereign AI models at scale, enabling industries across Saudi Arabia and worldwide to accelerate innovation and digital transformation.\nUnlocking the Era of Physical AI With NVIDIA Omniverse\nHUMAIN will deploy the\nNVIDIA Omniverse™\nplatform as a multi-tenant system to drive acceleration of the new era of physical AI and robotics through simulation, optimization and operation of physical environments by new human-AI-led solutions. This will allow industries such as manufacturing, logistics and energy to create fully integrated digital twins, boosting efficiency, safety and sustainability while fast-tracking the Kingdom’s journey toward Industry 4.0.\nEnabling the Kingdom’s AI Ecosystem Through Workforce Transformation\nTo support this transformation, HUMAIN and NVIDIA will collaborate on large-scale upskilling and training initiatives, providing thousands of Saudi citizens and developers with hands-on experience in advanced AI, simulation, robotics and digital twin technologies. This effort will contribute to building a robust national AI ecosystem and align with Saudi Arabia’s Vision 2030 goals of economic diversification and digital leadership.\n“AI, like electricity and internet, is essential infrastructure for every nation,” said Jensen Huang, founder and CEO of NVIDIA. “Together with HUMAIN, we are building AI infrastructure for the people and companies of Saudi Arabia to realize the bold vision of the Kingdom.”\n“We thank NVIDIA for their strategic partnership with the Kingdom. This collaboration with HUMAIN marks a turning point, building the AI factories of the future, unlocking compute and powering the next era of physical AI,” said His Excellency Eng. Abdullah Alswaha, Minister of Communications and Information Technology. “This lays the groundwork for a new industrial revolution, anchored in advanced infrastructure, talent and global ambition. This is how Saudi Arabia continues to lead as a partner of choice in shaping the future of AI.”\n“Our partnership with NVIDIA is a bold step forward in realizing the Kingdom’s ambitions to lead in AI and advanced digital infrastructure,” said Tareq Amin, CEO of HUMAIN. “Together, we are building the capacity, capability and a new globally enabled community to shape a future powered by intelligent technology and empowered people.”"}
{"spider": "nvidia", "url": "https://nvidianews.nvidia.com/news/saudi-arabia-and-nvidia-to-build-ai-factories-to-power-next-wave-of-intelligence-for-the-age-of-reasoning", "title": "Saudi Arabia and NVIDIA to Build AI Factories to Power Next Wave of Intelligence for the Age of Reasoning", "date": "2025-05-13 00:00:00", "content": "NVIDIA and the Kingdom of Saudi Arabia (KSA) today announced partnerships to transform the country into a global powerhouse in AI, cloud and enterprise computing, digital twins and robotics.\nDuring a state visit today with U.S. President Donald Trump and His Royal Highness Prince Mohammed bin Salman bin Abdulaziz Al Saud, Crown Prince and Prime Minister of Saudi Arabia, NVIDIA founder and CEO Jensen Huang said that the effort will harness sovereign AI infrastructure and expertise to propel Saudi Arabia to the ranks of global hyperscale AI leaders.\n“AI, like electricity and internet, is essential infrastructure for every nation,” Huang said. “Together with HUMAIN, we are building AI infrastructure for the people and companies of Saudi Arabia to realize the bold vision of the Kingdom.”\n“Our partnership with NVIDIA is a bold step forward in realizing the Kingdom’s ambitions to lead in AI and advanced digital infrastructure,” said Tareq Amin, CEO of HUMAIN. “Together, we are building the capacity, capability and a new globally enabled community to shape a future powered by intelligent technology and empowered people.”\nPowerful Partnerships\nNVIDIA and leading Saudi organizations will work together on several key initiatives:\nHUMAIN, a subsidiary of Saudi Arabia’s Public Investment Fund focused on AI, is making a major investment to build AI factories in KSA with a projected capacity of up to 500 megawatts powered by several hundred thousand of NVIDIA’s most advanced GPUs over the next five years. The first phase of deployment will be an 18,000 NVIDIA GB300 Grace Blackwell AI supercomputer with NVIDIA InfiniBand networking.\nHUMAIN will deploy the country’s first NVIDIA Omniverse Cloud to simulate and test physical AI solutions with digital twins.\nNVIDIA will strengthen the nation’s computing ecosystem and train thousands of developers with the skills to solve complex challenges with accelerated computing and AI.\nNVIDIA and the Saudi Data & AI Authority (SDAIA) will deploy up to 5,000 Blackwell GPUs for a sovereign AI factory and enable smart city solutions. NVIDIA and SDAIA will train government and university scientists and engineers on how to develop and deploy models for physical and agentic AI.\nAramco Digital will develop AI computing infrastructure, collaborate with NVIDIA’s startup ecosystem, establish AI enterprise platforms, and create an engineering and robotics center of excellence including NVIDIA platforms.\n“This partnership with NVIDIA reflects SDAIA’s commitment to harnessing and advancing the potential of data and AI through continuous innovation,” said H.E. Dr. Abdullah bin Sharaf Alghamdi, president of the SDAIA. “It marks a significant step toward positioning the Kingdom as a leader among data- and AI-driven economies, and in building a knowledge-based society and an advanced digital economy aligned with the objectives of Saudi Vision 2030.”\nThese initiatives will help industries such as energy, manufacturing and logistics to develop and deploy innovative solutions using the power of AI and digital twins to fuel growth and prosperity throughout the region, while boosting efficiency, safety and sustainability.\nThis effort will contribute to building a robust AI ecosystem and aligns with Saudi Arabia’s Vision 2030 goals of economic diversification and digital leadership."}
